using System;
using Microsoft.EntityFrameworkCore.Migrations;

#nullable disable

#pragma warning disable CA1814 // Prefer jagged arrays over multidimensional

namespace Bookstore.Migrations
{
    /// <inheritdoc />
    public partial class Init : Migration
    {
        /// <inheritdoc />
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.CreateTable(
                name: "AspNetRoles",
                columns: table => new
                {
                    Id = table.Column<string>(type: "nvarchar(450)", nullable: false),
                    Name = table.Column<string>(type: "nvarchar(256)", maxLength: 256, nullable: true),
                    NormalizedName = table.Column<string>(type: "nvarchar(256)", maxLength: 256, nullable: true),
                    ConcurrencyStamp = table.Column<string>(type: "nvarchar(max)", nullable: true)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_AspNetRoles", x => x.Id);
                });

            migrationBuilder.CreateTable(
                name: "AspNetUsers",
                columns: table => new
                {
                    Id = table.Column<string>(type: "nvarchar(450)", nullable: false),
                    CustomerName = table.Column<string>(type: "nvarchar(max)", nullable: false),
                    Address = table.Column<string>(type: "nvarchar(max)", nullable: false),
                    RegisterationDate = table.Column<DateTime>(type: "datetime2", nullable: false),
                    UserName = table.Column<string>(type: "nvarchar(256)", maxLength: 256, nullable: true),
                    NormalizedUserName = table.Column<string>(type: "nvarchar(256)", maxLength: 256, nullable: true),
                    Email = table.Column<string>(type: "nvarchar(256)", maxLength: 256, nullable: true),
                    NormalizedEmail = table.Column<string>(type: "nvarchar(256)", maxLength: 256, nullable: true),
                    EmailConfirmed = table.Column<bool>(type: "bit", nullable: false),
                    PasswordHash = table.Column<string>(type: "nvarchar(max)", nullable: true),
                    SecurityStamp = table.Column<string>(type: "nvarchar(max)", nullable: true),
                    ConcurrencyStamp = table.Column<string>(type: "nvarchar(max)", nullable: true),
                    PhoneNumber = table.Column<string>(type: "nvarchar(max)", nullable: true),
                    PhoneNumberConfirmed = table.Column<bool>(type: "bit", nullable: false),
                    TwoFactorEnabled = table.Column<bool>(type: "bit", nullable: false),
                    LockoutEnd = table.Column<DateTimeOffset>(type: "datetimeoffset", nullable: true),
                    LockoutEnabled = table.Column<bool>(type: "bit", nullable: false),
                    AccessFailedCount = table.Column<int>(type: "int", nullable: false)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_AspNetUsers", x => x.Id);
                });

            migrationBuilder.CreateTable(
                name: "Authors",
                columns: table => new
                {
                    Id = table.Column<string>(type: "nvarchar(450)", nullable: false),
                    Name = table.Column<string>(type: "nVarChar(50)", nullable: false),
                    About = table.Column<string>(type: "nvarchar(max)", nullable: false),
                    ImageURL = table.Column<string>(type: "nvarchar(50)", nullable: false)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_Authors", x => x.Id);
                });

            migrationBuilder.CreateTable(
                name: "Books",
                columns: table => new
                {
                    Id = table.Column<string>(type: "nvarchar(450)", nullable: false),
                    Title = table.Column<string>(type: "nVarchar(100)", nullable: false),
                    ImageURL = table.Column<string>(type: "nVarchar(100)", nullable: false),
                    Description = table.Column<string>(type: "nVarchar(MAX)", nullable: false),
                    NumberOfPages = table.Column<int>(type: "int", nullable: false),
                    Category = table.Column<string>(type: "nvarchar(max)", nullable: false),
                    Price = table.Column<int>(type: "int", nullable: false)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_Books", x => x.Id);
                });

            migrationBuilder.CreateTable(
                name: "AspNetRoleClaims",
                columns: table => new
                {
                    Id = table.Column<int>(type: "int", nullable: false)
                        .Annotation("SqlServer:Identity", "1, 1"),
                    RoleId = table.Column<string>(type: "nvarchar(450)", nullable: false),
                    ClaimType = table.Column<string>(type: "nvarchar(max)", nullable: true),
                    ClaimValue = table.Column<string>(type: "nvarchar(max)", nullable: true)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_AspNetRoleClaims", x => x.Id);
                    table.ForeignKey(
                        name: "FK_AspNetRoleClaims_AspNetRoles_RoleId",
                        column: x => x.RoleId,
                        principalTable: "AspNetRoles",
                        principalColumn: "Id",
                        onDelete: ReferentialAction.Cascade);
                });

            migrationBuilder.CreateTable(
                name: "AspNetUserClaims",
                columns: table => new
                {
                    Id = table.Column<int>(type: "int", nullable: false)
                        .Annotation("SqlServer:Identity", "1, 1"),
                    UserId = table.Column<string>(type: "nvarchar(450)", nullable: false),
                    ClaimType = table.Column<string>(type: "nvarchar(max)", nullable: true),
                    ClaimValue = table.Column<string>(type: "nvarchar(max)", nullable: true)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_AspNetUserClaims", x => x.Id);
                    table.ForeignKey(
                        name: "FK_AspNetUserClaims_AspNetUsers_UserId",
                        column: x => x.UserId,
                        principalTable: "AspNetUsers",
                        principalColumn: "Id",
                        onDelete: ReferentialAction.Cascade);
                });

            migrationBuilder.CreateTable(
                name: "AspNetUserLogins",
                columns: table => new
                {
                    LoginProvider = table.Column<string>(type: "nvarchar(450)", nullable: false),
                    ProviderKey = table.Column<string>(type: "nvarchar(450)", nullable: false),
                    ProviderDisplayName = table.Column<string>(type: "nvarchar(max)", nullable: true),
                    UserId = table.Column<string>(type: "nvarchar(450)", nullable: false)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_AspNetUserLogins", x => new { x.LoginProvider, x.ProviderKey });
                    table.ForeignKey(
                        name: "FK_AspNetUserLogins_AspNetUsers_UserId",
                        column: x => x.UserId,
                        principalTable: "AspNetUsers",
                        principalColumn: "Id",
                        onDelete: ReferentialAction.Cascade);
                });

            migrationBuilder.CreateTable(
                name: "AspNetUserRoles",
                columns: table => new
                {
                    UserId = table.Column<string>(type: "nvarchar(450)", nullable: false),
                    RoleId = table.Column<string>(type: "nvarchar(450)", nullable: false)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_AspNetUserRoles", x => new { x.UserId, x.RoleId });
                    table.ForeignKey(
                        name: "FK_AspNetUserRoles_AspNetRoles_RoleId",
                        column: x => x.RoleId,
                        principalTable: "AspNetRoles",
                        principalColumn: "Id",
                        onDelete: ReferentialAction.Cascade);
                    table.ForeignKey(
                        name: "FK_AspNetUserRoles_AspNetUsers_UserId",
                        column: x => x.UserId,
                        principalTable: "AspNetUsers",
                        principalColumn: "Id",
                        onDelete: ReferentialAction.Cascade);
                });

            migrationBuilder.CreateTable(
                name: "AspNetUserTokens",
                columns: table => new
                {
                    UserId = table.Column<string>(type: "nvarchar(450)", nullable: false),
                    LoginProvider = table.Column<string>(type: "nvarchar(450)", nullable: false),
                    Name = table.Column<string>(type: "nvarchar(450)", nullable: false),
                    Value = table.Column<string>(type: "nvarchar(max)", nullable: true)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_AspNetUserTokens", x => new { x.UserId, x.LoginProvider, x.Name });
                    table.ForeignKey(
                        name: "FK_AspNetUserTokens_AspNetUsers_UserId",
                        column: x => x.UserId,
                        principalTable: "AspNetUsers",
                        principalColumn: "Id",
                        onDelete: ReferentialAction.Cascade);
                });

            migrationBuilder.CreateTable(
                name: "Carts",
                columns: table => new
                {
                    Id = table.Column<int>(type: "int", nullable: false)
                        .Annotation("SqlServer:Identity", "1, 1"),
                    CustomerId = table.Column<string>(type: "nvarchar(450)", nullable: false),
                    TotalPrice = table.Column<decimal>(type: "decimal(18,2)", nullable: false)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_Carts", x => x.Id);
                    table.ForeignKey(
                        name: "FK_Carts_AspNetUsers_CustomerId",
                        column: x => x.CustomerId,
                        principalTable: "AspNetUsers",
                        principalColumn: "Id",
                        onDelete: ReferentialAction.Cascade);
                });

            migrationBuilder.CreateTable(
                name: "BookAuthors",
                columns: table => new
                {
                    BookId = table.Column<string>(type: "nvarchar(450)", nullable: false),
                    AuthorId = table.Column<string>(type: "nvarchar(450)", nullable: false)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_BookAuthors", x => new { x.AuthorId, x.BookId });
                    table.ForeignKey(
                        name: "FK_BookAuthors_Authors_AuthorId",
                        column: x => x.AuthorId,
                        principalTable: "Authors",
                        principalColumn: "Id",
                        onDelete: ReferentialAction.Cascade);
                    table.ForeignKey(
                        name: "FK_BookAuthors_Books_BookId",
                        column: x => x.BookId,
                        principalTable: "Books",
                        principalColumn: "Id",
                        onDelete: ReferentialAction.Cascade);
                });

            migrationBuilder.CreateTable(
                name: "Comments",
                columns: table => new
                {
                    Id = table.Column<string>(type: "nvarchar(450)", nullable: false),
                    CommentText = table.Column<string>(type: "nVarChar(max)", nullable: false),
                    Rate = table.Column<int>(type: "int", nullable: false),
                    BookId = table.Column<string>(type: "nvarchar(450)", nullable: false)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_Comments", x => x.Id);
                    table.ForeignKey(
                        name: "FK_Comments_Books_BookId",
                        column: x => x.BookId,
                        principalTable: "Books",
                        principalColumn: "Id",
                        onDelete: ReferentialAction.Cascade);
                });

            migrationBuilder.CreateTable(
                name: "BookCart",
                columns: table => new
                {
                    BooksId = table.Column<string>(type: "nvarchar(450)", nullable: false),
                    CartsId = table.Column<int>(type: "int", nullable: false)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_BookCart", x => new { x.BooksId, x.CartsId });
                    table.ForeignKey(
                        name: "FK_BookCart_Books_BooksId",
                        column: x => x.BooksId,
                        principalTable: "Books",
                        principalColumn: "Id",
                        onDelete: ReferentialAction.Cascade);
                    table.ForeignKey(
                        name: "FK_BookCart_Carts_CartsId",
                        column: x => x.CartsId,
                        principalTable: "Carts",
                        principalColumn: "Id",
                        onDelete: ReferentialAction.Cascade);
                });

            migrationBuilder.InsertData(
                table: "Authors",
                columns: new[] { "Id", "About", "ImageURL", "Name" },
                values: new object[,]
                {
                    { "1", "هو طبيب وأديب مصري، ويعتبر من أشهر الكتاب في مجال أدب الرعب وأدب الشباب. ولد في مدينة طنطا عاصمة محافظة الغربية في مصر. متزوج وأب لطفلين هما محمد (12 سنة) ومريم (8 سنوات).\r\nتخرج أحمد خالد توفيق في كلية الطب في جامعة طنطا عام 1985 م وحصل على الدكتوراه في طب المناطق الحارة عام 1997 م. يقدم أحمد خالد توفيق ستة سلاسل للروايات وصلت إلى ما يقرب من 236 عددا، وقد قام بترجمة عدد من الروايات الأجنبية ضمن سلسلة روايات عالمية للجيب. كما قدّم الترجمة العربية الوحيدة لرواية نادي القتال (fight club) للروائي الأمريكي تشاك بولانيك. كما أن له بعض التجارب الشعرية.\r\nوتُوفى إلى رحمة الله تعالى عن عمر يناهز 55 عامًا أثر أزمة صحية ألمت به(عليه رحمة الله تعالى وأسكنه الله فسيح جناته وأبدله سيئاته حسنات إن شاء الله)", "~/images/Authors/أحمد_خالد_توفيق.jpg", "أحمد خالد توفيق" },
                    { "10", "عمار علي حسن هو كاتب ومفكر مصري معاصر، متخصص في العلوم السياسية والاجتماعية. له العديد من المؤلفات في مجالات الفكر السياسي والاجتماعي والتنمية البشرية. يتميز بأسلوبه التحليلي العميق في تناول القضايا المعاصرة.", "~/images/Authors/عمار-علي-حسن.webp", "عمار علي حسن" },
                    { "11", "ابن خلدون (1332-1406) هو مؤرخ وفيلسوف وعالم اجتماع عربي. ولد في تونس وتوفي في مصر. اشتهر بمقدمته الشهيرة «مقدمة ابن خلدون» التي تعد من أهم المؤلفات في علم الاجتماع والتاريخ. يعتبر مؤسس علم الاجتماع الحديث وأول من وضع نظريات في تطور المجتمعات.", "~/images/Authors/ابن-خلدون.webp", "ابن خلدون" },
                    { "12", "إسماعيل مرسي هو كاتب ومفكر مصري معاصر، متخصص في مجال التنمية البشرية والفكر الإسلامي. له العديد من المؤلفات التي تجمع بين التراث الإسلامي والمعاصرة في تناول قضايا التنمية والتطوير.", "~/images/Authors/إسماعيل-مرسي.webp", "إسماعيل مرسي" },
                    { "13", "كاتب، من مؤلفاته: كتاب «الأندلس درة التاريخ الإسلامي (الفردوس المفقود)».", "~/images/Authors/default-avatar-male.jpg", "محمد سعيد محمد" },
                    { "14", "الدكتور أحمد صالح علي محمد هو باحث ومؤرخ متخصص في التاريخ العثماني. من أبرز مؤلفاته:\n\n«في أصول التاريخ العثماني»: تتناول هذه الدراسة فترة مهمة من التاريخ العثماني، مسلطةً الضوء على عهد السلطان سليمان القانوني، الذي يُعتبر من أبرز السلاطين العثمانيين، وتستعرض التحولات التي شهدتها الدولة خلال تلك الفترة.\n\n«أزمات الحكم في الدولة العثمانية (1808 - 1909 م)»: يركز هذا الكتاب على الأزمات السياسية والإدارية التي واجهتها الدولة العثمانية في القرن التاسع عشر وبداية القرن العشرين، مع تحليل لأسباب تلك الأزمات وتأثيرها على مسار الدولة.\n\n«الإصلاحيون في الدولة العثمانية في القرن 19 م (مدحت باشا أنموذجًا)»: يستعرض هذا العمل جهود الإصلاحيين في الدولة العثمانية خلال القرن التاسع عشر، مع التركيز على شخصية مدحت باشا وإسهاماته في محاولات تحديث الدولة.\n\nتُظهر أعمال الدكتور أحمد صالح علي محمد اهتمامًا عميقًا بفهم التحولات السياسية والإدارية في الدولة العثمانية، مع التركيز على فترات الأزمات والإصلاحات.", "~/images/Authors/default-avatar-male.jpg", "أحمد صالح علي محمد" },
                    { "15", "غسان كنفاني (عكا 9 أبريل 1936 - بيروت 8 يوليو 1972) هو روائي وقاص وصحفي فلسطيني، ويعتبر أحد أشهر الكتاب والصحافيين العرب في القرن العشرين. فقد كانت أعماله الأدبية من روايات وقصص قصيرة متجذرة في عمق الثقافة العربية والفلسطينية. ولد في عكا، شمال فلسطين، في التاسع من نيسان عام 1936م، وعاش في يافا حتى أيار 1948 حين أجبر على اللجوء مع عائلته في بادئ الأمر إلى لبنان ثم إلى سوريا. عاش وعمل في دمشق ثم في الكويت وبعد ذلك في بيروت منذ 1960 وفي تموز 1972، استشهد في بيروت مع ابنة أخته لميس في انفجار سيارة مفخخة على أيدي عملاء إسرائيليين.", "~/images/Authors/غسان كنفاني.png", "غسان كنفاني" },
                    { "2", " عاش مصطفى محمود في مدينة طنطا إلى جوار مسجد السيد البدوي الذي يعد أحد مزارات الصوفية الشهيرة في مصر مما ترك فيه نفسه أثرا واضحا ظهر في توجهاته وأفكاره ولقد تحدث مصطفى محمود عن تكوينه الفكري وعن طفولته التي هي مفتاح ذلك التكوين قائلا : لا اذكر من طفولتي إلا الأحلام التي كنت أتخيل فيها أنى عالم ومخترع أو رحال أو بطل من إبطال التاريخ كما أذكر حبي للموسيقى وللشعر ، وفى صباي تعلمت العزف على الناي وفى شبابي درست العزف على العود ، وكنت أكتب في أيام الدراسة الابتدائية الزجل والشعر وفى الثانوية القصص والمقالات والمسرحيات وهويت العلوم ، وأنشأت معملا للكيمياء والبيولوجيا في بيتى وكنت أحضر الغازات واشرح الضفادع ، نشرت لي أول قصة في مجلة الرسالة عام 1947 ثم بعد ذلك نشرت القصة الثانية في جريدة المصري ، ثم اشتغلت في أخر ساعة وأخبار اليوم وفى عام 1952 كنت احد مؤسسي مجلة التحرير وفى عام 1956 اشتغلت بمجلة روزاليوسف.\r\n\r\nكانت حياتي الأدبية خلال ثلاثين عاما هجرة مستمرة نحو إدراك الحياة والبحث عن الحقيقة وكان كل كتاب محطة على طريق هذا السفر الطويل.\r\n\r\n", "~/images/Authors/مصطفى محمود.jpg", "مصطفى محمود" },
                    { "3", "إبراهيم السكران (ولد في 5 ربيع الآخر 1396 هـ الموافق 4 أبريل 1976م) باحث ومُفكِّر إسلامي، مهتمٌ بمنهج الفقه الإسلامي وبالمذاهب العقدية والفكرية، له العديد من المؤلفات والأبحاث والمقالات المنشورة وله عدد من الكتب المطبوعة.\r\n\r\nسيرته\r\nهو أبو عُمر، إبراهيم بن عمر بن إبراهيم السكران المشرف الوهبي التميمي، درس في جامعة الملك فهد للبترول والمعادن سنة واحدة، ثم تركها متوجهًا إلى كلية الشريعة في جامعة الإمام محمد بن سعود الإسلامية بالرياض وتخرج منها، نال درجة الماجستير في السياسة الشرعيّة من المعهد العالي للقضاء التابع لجامعة الإمام محمد بن سعود الإسلامية بالرياض، ثم توجه إلى بريطانيا ونال درجة الماجستير في القانون التجاري الدولي في جامعة إسكس بمدينة كولشيستر.\r\n\r\nظهر تحوّل إبراهيم السكران إلى الفكر السلفي عام 1428 هـ 2007 م في ورقة فكريّة انتشرَت وقتها الكترونيًا، عنوانها: مآلات الخِطاب المدني، وقد أثارت هذه الورقة الكثير من المحسوبين على التيار التنويري.  ", "~/images/Authors/إبراهيم السكران.jpeg", "إبراهيم السكران" },
                    { "4", "أحمد مراد أحمد عبسلام (مواليد القاهرة 1978) كاتب ومصور ومصمم جرافيك مصري، تخرّج في مدرسة ليسيه الحرّية بباب اللوق عام 1996 قبل أن يلتحق بالمعهد العالي للسينما ليدرس التصوير السينمائي، وتخرّج عام 2001 بترتيب الأول على القسم، ونالت أفلام تخرّجه \"الهائمون - الثلاث ورقات - وفي اليوم السابع\" جوائز للأفلام القصيرة في مهرجانات بإنجلترا وفرنسا وأوكرانيا.\r\nبدأ مراد كتابة روايته الأولي \"فيرتيجو\" في شتاء عام 2007، ونُشِرت في نفس العام عن دار ميريت قبل أن تُترجم للّغة الإنجليزية عن دار بلومزبيري، ثم للإيطالية عن دار مارسيليو، والفرنسية عن دار فلاماريون، ثم تحولت الرواية لمسلسل تليفزيوني في رمضان من عام 2012 بعنوان فيرتيجو بطولة هند صبري، ونالت الرواية جائزة \"البحر الأبيض المتوسط للثقافة\" لعام 2013 من إيطاليا.\r\nفي فبراير 2010 أصدر مراد روايته الثانية بعنوان \"تراب الماس\" وتُرجمت للإيطالية عن دار مارسيليو وللألمانية، وتم تحويلها لفيلم سينمائي هذا العام 2018.من بطوله اسر ياسين و ماجد الكدوانى.\r\nوفي أكتوبر 2012 صدرت روايته الثالثة \"الفيل الأزرق\" والتي نالت المركز الأول في مبيعات الكتب بمعرض القاهرة الدولي للكتاب 2013، ورشحت الرواية في القائمة القصيرة لجائزة البوكر العربية عام 2014.", "~/images/Authors/احمد مراد.jpg", "أحمد مراد" },
                    { "5", "محمد بن صالح العثيمين ، هو أبو عَبد الله مُحَمّد بن صَالِح بن مُحَمَّد بن سُلَيْمَان بن عبد الرَّحْمن العُثَيْمِين الوهيبي التميمي (29 مارس 1929 - 11 يناير 2001). ولد في ليلة 27 رمضان عام 1347 هـ، في عنيزة إحدى مدن القصيم. قرأ القرآن الكريم على جده من جهة أمه عبد الرحمن بن سليمان آل دامغ؛ فحفظه ثم اتجه إلى طلب العلم وتعلم الخط والحساب وبعض فنون الآداب.", "~/images/Authors/محمد بن صالح العثيمين.jpg", "محمد بن صالح العثيمين" },
                    { "6", "ستيفن آر كوفي (1932-2012) هو كاتب ومحاضر أمريكي في مجال التنمية البشرية والقيادة. اشتهر بكتابه الأكثر مبيعاً «العادات السبع للناس الأكثر فعالية» الذي بيع منه أكثر من 25 مليون نسخة. حصل على درجة الماجستير في إدارة الأعمال من جامعة هارفارد ودكتوراه في التعليم الديني من جامعة بريغهام يونغ. عمل مستشاراً للعديد من الشركات والمنظمات العالمية.", "~/images/Authors/ستيفن-آر-كوفي.webp", "ستيفن آر كوفي" },
                    { "7", "جيمس كلير هو كاتب ومتحدث أمريكي متخصص في علم النفس السلوكي وتطوير العادات. اشتهر بكتابه «العادات الذرية» الذي يقدم منهجاً عملياً لتطوير العادات الصغيرة التي تؤدي إلى تغييرات كبيرة في الحياة. يقدم محتوى علمياً مبسطاً حول كيفية بناء عادات إيجابية والتخلص من العادات السلبية.", "~/images/Authors/جيمس-كلير.webp", "جيمس كلير" },
                    { "8", "مارك مانسون هو كاتب ومؤلف أمريكي معاصر، اشتهر بكتابه «فن اللامبالاة» الذي حقق مبيعات عالية. يتميز بأسلوبه المباشر والصادق في تناول مواضيع التنمية الذاتية والسعادة. يقدم رؤية مختلفة عن الكتب التقليدية في مجال التنمية البشرية، مع التركيز على قبول الواقع والتعامل معه بشكل عملي.", "~/images/Authors/مارك-مانسون.webp", "مارك مانسون" },
                    { "9", "إرنستو ساباتو (1911-2011) هو روائي وكاتب مقالات أرجنتيني. درس الفيزياء في جامعة لا بلاتا وعمل في مختبر كوري في باريس. اشتهر برواياته «النفق» و«عن الأبطال والقبور» التي تعتبر من أهم الأعمال الأدبية في أمريكا اللاتينية. حصل على العديد من الجوائز الأدبية المرموقة.", "~/images/Authors/إرنستو-ساباتو.webp", "إرنستو ساباتو" }
                });

            migrationBuilder.InsertData(
                table: "Books",
                columns: new[] { "Id", "Category", "Description", "ImageURL", "NumberOfPages", "Price", "Title" },
                values: new object[,]
                {
                    { "1", "Literature", "لم يكن \"طه\" سوى مندوب دعاية طبية فى شركة أدوية, حياة باهتة رتيبة, بدلة وكرافتة وحقيبة جلدية ولسان لبق يستميل أعتى الأطباء لأدويته.. كان ذلك قبل أن يسقط..\r\nجريمة قتل غامضة تتركه خلفها وقد تبدل عالمه.. للأبد.. تتحول حياته إلى جزيرة من الأسرار, يبدأ اكتشافها فى دفتر عتيق يعثر عليه مصادفة, ويجد أداة رهيبة لها فعل السحر.. سنقرأ هنا كيف تتحول هذه الجريمة إلى سلسلة من عمليات القتل. وكيف يصبح القتل بابا يكشف لنا عالما من الفساد, وسطوة السلطة التى تمتد لأجيال فى تتابع مثير لا يؤكد أبدا أن \"طه\" سيصل إلى نهايته..", "~/Images/Books/تراب الماس.webp", 448, 220, "تراب الماس" },
                    { "10", "Literature", "مجموعة قصصية مشوقة تدور أحداثها داخل غرفة غامضة تحمل أسرارًا لا تنتهي، حيث يصبح الدخول إليها تجربة تغير حياة كل من يقترب منها.", "~/Images/Books/حكايات الغرفة 207.webp", 200, 190, "حكايات الغرفة 207" },
                    { "11", "Literature", "رحلة فكرية مرعبة في دهاليز العقل والروح، تجمع بين التشويق والخيال العلمي، بأسلوب فلسفي عميق يلامس النفس الإنسانية.", "~/Images/Books/عقل بلا جسد.webp", 190, 195, "عقل بلا جسد" },
                    { "12", "Literature", "مجموعة من القصص القصيرة التي تستعرض مواقف إنسانية في ظلال الليل، حيث تتجلى مشاعر الوحدة والخوف والحنين.", "~/Images/Books/رفقاء الليل.webp", 240, 185, "رفقاء الليل" },
                    { "13", "Literature", "كتاب تاريخي يقدم عرضًا مبسطًا وممتعًا لحياة المصريين القدماء، وعاداتهم، وعلومهم، وأسلوب حياتهم اليومي.", "~/Images/Books/في ممر الفئران.webp", 310, 210, "في ممر الفئران" },
                    { "14", "Literature", "رواية سوداوية عن مستقبل مرعب، تتخيل انقسام المجتمع المصري إلى طبقتين: الأغنياء في الجنة والطبقة المسحوقة في الجحيم، في إطار درامي فلسفي.", "~/Images/Books/يوتوبيا.webp", 172, 295, "يوتوبيا" },
                    { "15", "Religious", "كتاب في العقيدة الاسلامية شرح فيه المؤلف أهم الركائز والاسس الايمانية والاعتقادية التي بني عليها الاسلام، وهو يقدم هذه الاصول بأسلوب واضح ومختصر ليسهل على .المتلقي فهمه", "~/Images/Books/شرح ثلاثة الأصول.webp", 200, 185, "شرح ثلاثة الأصول " },
                    { "16", "Religious", "يُعتبر كتاب 'شرح الأربعين النووية' من أهم الشروحات على متن الإمام النووي، الذي جمع فيه أربعين حديثًا نبوياً تُعد من جوامع الكلم. يتناول هذا الشرح كل حديث بالتفصيل من حيث معناه اللغوي والشرعي، وأسباب وروده، وربطه بواقع المسلم اليوم. كما يسلط الضوء على ما يستفيده المسلم من كل حديث في سلوكه وعقيدته، مع الوقوف على الأحكام الفقهية والعبر التربوية التي يتضمنها النص النبوي. يُعد هذا الكتاب بوابة مهمة لفهم السنة النبوية وبناء شخصية مسلمة متزنة.", "~/Images/Books/شرح الأربعين النووية.webp", 230, 595, "شرح الأربعين النووية" },
                    { "17", "Religious", "يتناول هذا الشرح تفصيلًا دقيقًا لألفية الإمام ابن مالك، وهي منظومة نحوية تُعد من أشهر المتون في علم النحو. الشرح لا يقتصر فقط على القواعد، بل يربطها بالتطبيقات العملية في اللغة العربية، مما يجعله مرجعًا لغويًا عظيمًا للطلاب والباحثين. يمتاز أسلوب الشارح بالسلاسة والوضوح، ويعرض المسائل النحوية بأمثلة من القرآن والسنة والشعر العربي، مما يسهم في ترسيخ القاعدة في ذهن الطالب بأسلوب علمي رصين.", "~/Images/Books/شرح ألفية ابن مالك.webp", 480, 630, "شرح ألفية ابن مالك" },
                    { "18", "Religious", "رياض الصالحين هو كتاب جمع فيه الإمام النووي أحاديث منتقاة تتناول مكارم الأخلاق والآداب الإسلامية. ويأتي هذا الشرح ليجعل من هذه الأحاديث منارة سلوكية وتربوية في حياة المسلم، حيث يبين معانيها ومقاصدها ويوضح كيف يمكن تطبيقها في الواقع المعاصر. يعتني الشارح بالربط بين الحديث والسلوك اليومي، ويضيف فوائد فقهية وتربوية تسهم في بناء شخصية إيمانية متكاملة تقوم على الإحسان والخلق الحسن.", "~/Images/Books/شرح رياض الصالحين.webp", 600, 750, "شرح رياض الصالحين" },
                    { "19", "Religious", "صحيح البخاري هو أصح كتاب بعد كتاب الله، وشروحه تُعد من أعظم ما كُتب في علم الحديث. وهذا الشرح يُقدم تفسيرًا دقيقًا للأحاديث من جوانب متعددة: فقهية، لغوية، وسياقية، مع تحليل للأسناد وبيان للعلل والروايات. يربط بين فقه الحديث وأقوال العلماء، ويوضح المسائل الخلافية بعمق، مما يجعله مصدرًا لا غنى عنه لطالب العلم في فهم الحديث النبوي الشريف وتطبيقه في مختلف مجالات الحياة.", "~/Images/Books/شرح صحيح البخاري.webp", 1200, 830, "شرح صحيح البخاري" },
                    { "2", "Literature", "الرواية فانتازية خيالية تدور أحداثها حول دكتور للأمراض العقلية يدعى - يحيى - كان يعمل في مستشفى العباسية ، كان مدمنا للخمر وتعرض لحادث أدى إلى وفاة زوجته وابنته ، فانعزل عن العالم لمدة خمس سنوات وبعد انقطاع عن العمل عاد مرة أخرى للعمل في نفس المستشفى إلا أنه يتفاجأ بوجود صديق قديم يدعى - شريف - وهو نزيل بالمستشفى كان له ماضي أراد أن ينساه طويلا إلا أنه وقع تحت رحمة يحيى ، فتنقلب حياة يحيى وصديقه راسا على عقب حيث يبدأ يحيى بالتنقيب والبحث عن حقيقة صديقه عبرة رحلة استكشافية مثيرة مليئة بالعالم الغريب والخيالي ليظهر بها الكاتب الخبايا النفسية للبشر وغرائبها .", "~/Images/Books/Al-Feel_al-Azraq.jpg", 485, 310, "الفيل الأزرق" },
                    { "20", "Religious", "كتاب 'مصطلح الحديث' يُعد مدخلاً أساسيًا لفهم علوم الحديث الشريف، حيث يشرح مصطلحات المحدثين مثل: الصحيح، الحسن، الضعيف، المرسل، المعضل وغيرها. يوضح قواعد قبول ورد الحديث، ويُعرّف بأنواع العلل والسند والرواة. بأسلوب تعليمي منظم، يساعد الطالب على التمييز بين درجات الأحاديث وفهم المنهج النقدي عند علماء الحديث. هو حجر أساس لفهم السنة النبوية بعلم ودراية وتمييز بين الغث والسمين في الروايات.", "~/Images/Books/مصطلح الحديث.webp", 310, 410, "مصطلح الحديث" },
                    { "21", "SelfDevelopment", "العادات السبع للناس الأكثر فعالية بقلم ستيفن آر. كوفي ... نظراً لكون هذا الكتاب من أكثر الكتب المؤلفة إلهاماً وتأثيراً، فقد أسر القراء طوال الخمسة والعشرين عاماً الماضية، وقد حول حياة عدد من الرؤساء وكبار المديرين التنفيذيين والمحاضرين والآباء. فنقول بإيجاز إنه حول حياة ملايين الأشخاص من مختلف الأعمار والوظائف. ومن حين لآخر يظهر لنا كتاب لا يغير حياة القراء وحسب، بل يترك أثراً في الثقافة ذاتها، وهذا الكتاب ينتمي إلى هذه الفئة.", "~/Images/Books/العادات-السبع-للناس-الأكثر-فعالية-1425-250x375-webp.webp", 350, 240, "العادات السبع للناس الأكثر فعالية" },
                    { "22", "SelfDevelopment", "العادات السبع للمراهقين الأكثر فعالية بقلم شين كوفي ... هذا الكتاب مليء بالقصص المدهشة يرويها مراهقون اليوم عن أنفسهم، وهي قصص كتبت بدوافع عديدة مثل الغضب والإحباط والمرح والحماس والوحدة والنجاح والأمل والإلهام. الرسوم الكرتونية والأفكار والاقتباسات التي يحتويها الكتاب تجعله مثيراً وجذاباً وملائماً للموضوع من الغلاف إلى الغلاف. وبالإضافة إلى هذا، فإن الكتاب يضع دليلاً مفصلاً خطوة بخطوة يساعد المراهقين على بناء صورة الذات وعلاقات الصداقة ومقاومة ضغط النظراء وتعلمهم كيفية تحقيق أهدافهم طويلة الأجل.", "~/Images/Books/العادات-السبع-للمراهقين-الأكثر-فعالية-1424-250x375-webp.webp", 280, 220, "العادات السبع للمراهقين الأكثر فعالية" },
                    { "23", "SelfDevelopment", "العادات الذرية بقلم جيمس كلير ... أيّاً كانت أهدافك، فإن كتاب \"العادات الذرية\" يقدم لك إطار عمل من أجل تطوير مهاراتك في كل يوم. جيمس كلير واحد من أبرز الخبراء في مجال اكتساب العادات، يوضح لنا في كتابه هذا استراتيجيات عملية تعلمنا كيف نستطيع اكتساب عادات جيدة، وكيف نتخلص من القديمة السلبية، ويشرح لنا طريقة إدارة وإتقان أفعالنا اليومية البسيطة التي نستطيع من خلالها تحقيق نتائج مذهلة. يعلمنا هذا الكتاب: كيف نخلق الوقت من أجل اكتساب عادات جديدة، كيف نتخلص من نقص الحافز، ونتمتع بقوة الإرادة، كيف نغير بيئتنا المحيطة لتحقيق نتائج إيجابية في الحياة.", "~/Images/Books/العادات-الذرية-608-250x375-webp.webp", 320, 230, "العادات الذرية" },
                    { "24", "SelfDevelopment", "خراب (كتاب عن الأمل) بقلم مارك مانسون ... هل تساءلت يوماً لماذا يبدو أن ازدياد إمكانية التواصل بين الناس يجعلهم أكثر تباغضاً؟ وهل تساءلت يوماً عما يجعل الناس يشعرون أنهم أكثر قلقاً وتعاسة على الرغم من ازدياد حياتهم يسراً؟ حسناً، شدوا الأحزمة! سوف يأخذكم العم مارك في رحلة جديدة! ومثلما شكك كتابه «فن اللامبالاة» في حكمتنا التقليدية المعتادة حول ما يجعلنا سعداء، يأتي كتاب «خراب: كتاب عن الأمل» ليضع موضع التساؤل كل ما لدينا من افتراضات عما يجعل الحياة جديرة بأن تُعاش. إننا نعيش زمناً لافتاً! فمن الناحية المادية، صار كل شيء أفضل من أي وقت مضى - نحن الآن أكثر حرية وبحبوحة من أي جيل سابق في تاريخ البشر. لكن كل شيء يبدو - لسبب ما - كما لو أنه سيء إلى حد فظيع لا يمكن تداركه. ففي هذه اللحظة من لحظات التاريخ، حين صار في متناولنا ما لم يحلم به أسلافنا من تعليم وتكنولوجيا واتصالات، يعود كثير منا فيجد نفسه تحت وطأة إحساس طاغ بانعدام الأمل. فما الأمر؟ هذا ما يحاول مارك مانسون إخراجنا منه. نشر مانسون كتابه «فن اللامبالاة» في سنة 2016، فحقق نجاحاً لامعاً في تحديد معالم القلق الخفي المستمر الذي يتخلل الحياة الحديثة. لقد بين لنا أن ما خلقته حياتنا الحديثة في نفوسنا من دافع لا يهدأ إلى السعي الدائم خلف السعادة لا يفلح إلا في جعلنا أقل سعادة من ذي قبل. وقد كانت النتيجة كتاباً تحول إلى ظاهرة عالمية فباع ملايين النسخ في أنحاء الأرض واحتل المركز الأول في ثلاثة عشر بلداً. والآن، مع «خراب: كتاب عن الأمل»، يحوّل مانسون نظره من العيوب التي لا مهرب منها في نفس كل فرد إلى الكوارث التي لا نهاية لها في العالم من حولنا. يعتمد مانسون على ميدان أبحاث علم النفس في هذه الموضوعات، وعلى الأفكار الحكيمة الخالدة للعديد من الفلاسفة، فيشرح السياسة والدين وعلاقاتنا بالمال والإنترنت وعالم التسلية، وكيف يمكن للإفراط في أشياء جيدة أن يأكلنا أحياء من الناحية النفسية، وهو يتحدى من غير مواربة تعريفاتنا للإيمان والسعادة والحرية، بل حتى للأمل نفسه.", "~/Images/Books/خراب-كتاب-عن-الأمل-2159-250x375-webp.webp", 240, 225, "خراب: كتاب عن الأمل" },
                    { "25", "SelfDevelopment", "فن اللامبالاة (لعيش حياة تخالف المألوف) بقلم مارك مانسون ... ظل يُقال لنا طيلة عشرات السنوات إن التفكير الإيجابي هو المفتاح إلى حياة سعيدة ثرية. لكن مارك مانسون يشتم تلك \"الإيجابية\" ويقول: \"فلنكن صادقين، السيء سيء وعلينا أن نتعايش مع هذا\". لا يتهرّب مانسون من الحقائق ولا يغلفها بالسكّر، بل يقولها لنا كما هي: جرعة من الحقيقة الفجِّة الصادقة المنعشة هي ما ينقصنا اليوم. هذا الكتاب ترياق للذهنية التي نهدهد أنفسنا بها، ذهنية \"فلنعمل على أن يكون لدينا كلنا شعور طيب\" التي غزت المجتمع المعاصر فأفسدت جيلاً بأسره صار ينال ميداليات ذهبية لمجرد الحضور إلى المدرسة. ينصحنا مانسون بأن نعرف حدود إمكاناتنا وأن نتقبلها. وأن ندرك مخاوفنا ونواقصنا وما لسنا واثقين منه، وأن نكفّ عن التهرب والفرار من ذلك كله ونبدأ مواجهة الحقائق الموجعة، حتى نصير قادرين على العثور على ما نبحث عنه من جرأة ومثابرة وصدق ومسؤولية وتسامح وحب للمعرفة. لا يستطيع كل شخص أن يكون متميزاً متفوقاً. ففي المجتمع ناجحين وفاشلين؛ وقسم من هذا الواقع ليس عادلاً وليس نتيجة غلطتك أنت. وصحيح أن المال شيء حسن، لكن اهتمامك بما تفعله بحياتك أحسن كثيراً؛ فالتجربة هي الثروة الحقيقية.", "~/Images/Books/فن-اللامبالاة-لعيش-حياة-تخالف-المألوف-2160-250x375-webp.webp", 260, 215, "فن اللامبالاة: لعيش حياة تخالف المألوف" },
                    { "26", "Miscellaneous", "الكاتب وأشباحه بقلم إرنستو ساباتو ... يتضمن هذا الكتاب تنويعات على الموضوع نفسه، وهو موضوع طالما استحوذ على تفكيري منذ أن شرعت في الكتابة: لماذا، وكيف، وما الغرض من كتابة الأدب؟ ولقد طرحت أنا نفسي هذه الأسئلة عدداً لا يحصى من المرات، كما طرحها عليّ قراء وصحفيون؛ لأدرك في كلّ مرة من هذه المرات الدوافع الخفية التي تحمل إنساناً على الكتابة، بصورة جادة إلى حدّ الهوس، عن أشخاص وأحداث لا تنتمي إلى عالم الواقع، ويبدو أنها، بالرغم من ذلك، قدّمت، بآليةٍ شديدة الغرابة، الشهادة الأكثر أصالة عن الواقع المعاصر.", "~/Images/Books/الكاتب-وأشباحه-45805-250x375-webp.webp", 254, 105, "الكاتب وأشباحه" },
                    { "27", "Miscellaneous", "النص والسلطة والمجتمع (القيم السياسية في الرواية العربية) بقلم عمار علي حسن ... يُقيمُ هذا الكتابُ جسراً عريضاً بين الأدب وعلم السياسة دونَ أن يجعل الأوَّلَ في خدمة الثاني أو مَطيَّةً له، فهذا يُحوِّل النصوص الأدبية، روائية وقصصية وشعرية ومسرحية، إلى بيانٍ أو منشورٍ أو أيديولوجيا، بما يجرح جمالها الفنِّي بل يقتله أحياناً، إنما هو يدرس، عبر عشرين روايةً عربية، قيَم الحُريَّة والعدل والمساواة والانتماء، بعد تمهيدٍ نظريّ تناول النصَّ الأدبي من الخارج، فأظهرَ تأثير النظام السياسي والأيديولوجيَّات والظروف الاقتصاديَّة وأفعال السُّلْطة وأحوال المجتمع على الأدب، ثم من الداخل مُستخدماً مختلف نظريَّات النقد الأدبيّ في تحليل النصوص من النواحي الجماليَّة والشكليَّة، وكل ما تنطوي عليه من علاماتٍ وإشارات. والكتابُ هو أطروحةُ الدكتوراه في العلوم السياسيَّة لمُؤلِّفه ناقشها عام 2001، وصدرت منه عدَّةُ طبعات، ورغم أنه عملٌ أكاديميٌّ فقد صِيغَ بأسلوبٍ سَلِس، يحافظ على دقَّة الكتابة العلميَّة، وفي الوقت نفسه، يمتثلُ لضرورة وصول المعنى إلى أغلب الناس، سواء المُهتمِّين بدراسة الأدب ومتابعته وقراءته وتذوُّقه أم المُختصِّين في العلوم الإنسانيَّة، أو حتى القارئ العاديّ الراغب في تعزيز ثقافته، وتعميق فهمه.", "~/Images/Books/النص-والسلطة-والمجتمع-2-52185-250x375-webp.webp", 324, 210, "النص والسلطة والمجتمع" },
                    { "28", "History", "أساطير عربية 1 بقلم إسماعيل مرسي ... على الرَّغْمِ مِنْ كَونِنَا في عَصرِ المادَّةِ والتقدم التكنولوجي، إلا أن سحر ومتعة الأساطير لم يفقدا بريقهما وتأثِيرَهُمَا، فَمِنْ خلال سطورها ننتقل عبر حدود الزمان والمكان وإلى ما وراء العقل كذلك؛ فتخوض بنا عُباب بحور الدُّنيا ومحيطاتها، وتهيم بنا في براريها، وتصعد بنا الجبال، وتهبط بنا السهول والوديان، وتطوف بنا في أقطار الأرض شرقها وغربها، وتحلّق بنا في سمواتها وتجول بنا بين كواكبها، وتذكرُ لنَا طُرَفاً مِنْ غرائب سُكّان الأرض وطبائعهم، وعجائب ما عملوا وغريب ما صنعوا، واختلاف أخلاقهم شرها وخيرها، فنجد فيها العظة والإرشاد والتجربة. وبعد أن قدمنا لقارئنا الكريم كتاب أساطير الإغريقية، التي لاقت استحساناً كبيراً مِنَ القُراء؛ قررْنَا أن نقدم لهم الأساطير العربية؛ فهي لا تقل تميزاً ولا لذَّةً عَن تلك الأساطير المشهورة ... فانتقينا من بين عشرات الكتب تلك الباقة التي بين يديك.", "~/Images/Books/أساطير-عربية-1-53295-250x375-webp.webp", 352, 200, "أساطير عربية 1" },
                    { "29", "History", "كتاب تاريخي شامل يتناول تاريخ الأندلس الإسلامية، حضارتها، وإنجازاتها العلمية والثقافية.", "~/Images/Books/الأندلس-درة-التاريخ-الإسلامي-الفردوس-المفقودة-55627-250x375-webp.webp", 454, 230, "الأندلس: درة التاريخ الإسلامي - الفردوس المفقود" },
                    { "3", "Literature", "سيختطفك أحمد مراد في آلة زمن، ليهبط بك في حقبة تغلي فيها القاهرة بالأحداث.. وثبة زمنية إلى عالم متشابك يمسك المؤلف مقتدرًا بكل مفاتيحه؛ بين سعد زغلول وتعنت البريطانيين، قصة الوفد ومقهى \"متاتيا\" جماعة سرية تعمل تحت مقهى \"ريش\"، وعوالم البغاء المقنن.. شخصيات عديدة سوف تتعاطف معها أو تمقتها، أو تفعل الشيئين بلا تحفظ، بحوار مفعم بالحيوية حتى لتوشك على سماعه يتردد في أذنك، وتفاصيل تاريخية مضنية ودقيقة. سوف تدرك أن البعض ما زال مصرًّا على الجدية والإتقان.", "~/Images/Books/1919.jpeg", 485, 330, "1919" },
                    { "30", "History", "دراسة تاريخية مفصلة عن فترة الإصلاحات العثمانية وتأثيرها على الدولة والمجتمع.", "~/Images/Books/عصر-التنظيمات-والإصلاحات-العثمانية-55652-250x375-webp.webp", 380, 220, "عصر التنظيمات والإصلاحات العثمانية" },
                    { "31", "History", "تحليل تاريخي لأزمات الحكم في الدولة العثمانية وأسبابها وتأثيراتها على مسار الدولة.", "~/Images/Books/أزمات-الحكم-في-الدولة-العثمانية-2-55722-250x375-webp.webp", 320, 215, "أزمات الحكم في الدولة العثمانية" },
                    { "32", "History", "مقدمة ابن خلدون (مجلد هارد كوفر) بقلم ابن خلدون ... في عام 1377م، خطَّ ابن خلدون كتابه \"مقدمة ابن خلدون\"، لتكون مفتاحاً ومقدمةً لأحد أضخم المؤلفات التاريخية \"كتاب العبر\". غير أن هذه المقدمة، التي حملت بذورَ المعرفة الكثيرة، أصبحت لاحقاً مؤلفاً مستقلّاً في ذاته، موسوعيّاً في محتواه، إذ غَصَّت بين طياته ميادين العلم كلها، من الشريعة والتاريخ والجغرافيا، إلى الاقتصاد والعمران والاجتماع والسياسة والطب. كان ابن خلدون في مقدمته كعالم فلكي يدرس حركة النجوم في السماء، فدرس أحوال البشر واختلافات طبائعهم، كما يدرس تأثير البيئة في الإنسان، كأنما هو طبيب اجتماعي يعكف على تشخيص الأمراض التي تصيب الأمم. وفي هذا الكتاب، سبق ابن خلدون غيره من المفكرين إلى العديد من الآراء والأفكار العميقة التي كانت بمنزلة إشعاعات جديدة تنير درب المعرفة. وقد اعتُبر بذلك مؤسساً لعلم الاجتماع، متفوقاً على الفيلسوف الفرنسي أوغست كونت، الذي جاء بعده بقرون عديدة.", "~/Images/Books/مقدمة-ابن-خلدون-5-49901-250x375-webp.webp", 500, 560, "مقدمة ابن خلدون (مجلد هارد كوفر)" },
                    { "33", "Literature", "فيرتيجو بقلم أحمد مراد ... «رواية ڨيرتيجو مغامرةٌ تستحق التشجيع لأن كاتبها – على حداثة عهده بالكتابة – لديه معرفةٌ عميقةٌ بتقنيات الكتابة الروائية من حيث هي عملية فنية بالأساس، هذا إلى جانب تَمتُّعه بحسٍّ عالٍ مَكَّنه من تحليل مُكونات المجتمع المصري الحالي.» صنع الله إبراهيم. الصدفة البحتة هي التي جعلت مُصوّرَ الأفراح الشاب أحمد كمال يلتقط صوراً لمعركة دموية بين كبار رجال الأعمال في مصر في بار «ڨيرتيجو» الشهير والذي يرتاده صفوة المجتمع، فيتحوّل المكانُ في ثوانٍ إلى بركة من الدماء والجثث... ويضطر أحمد إلى الهرب من القتلة والاختباء ليبدأ رحلةً لا تُصدَّق؛ تكشف العديد من الأسرار والفضائح التي يحاول أصحابُها التَّكتمَ عليها بأي ثمنٍ. لعبةٌ سياسيةٌ واسعةُ النطاق يواجهها أحمد ضد حيتان لا تَرحم... لعبةٌ للخسارة فيها ثمنٌ وحيدٌ... حياته... روايةٌ مثيرةٌ كشفتِ الواقعَ المصري اليوم، ونالت استحسانَ النقاد والقرَّاء في مصر والعالم.", "~/Images/Books/فيرتيجو.webp", 280, 210, "فيرتيجو" },
                    { "34", "Literature", "حظك اليوم بقلم أحمد خالد توفيق... اثنا عشر برجاً، اثنتا عشرة طريقة للموت، ولعنة تطاردك في كل صوب. تمر بالأطوار المعتادة: في البداية أنت لا تعرف... بعد هذا أنت لا تلاحظ... ثم تلاحظ فلا تصدق... ثم تصدق فلا تعرف ما ينبغي عمله. يقول الغربيون أنك لا يمكن أن تكون حذراً أكثر من اللازم. وهذه القصص تطبيق عملي صادق لصحة هذه المقولة.", "~/Images/Books/حظك اليم.webp", 220, 190, "حظك اليوم" },
                    { "35", "Literature", "هي 13 قصة قصيرة... بينها كلها عامل مشترك... هو وضوح الفكرة في النهاية... تنساق القصة في انسيابية وسلاسة حتى تدرك من الجاني... ما السبب... وكيف حدث ما حدث... في النهاية وقتها فقط تدرك الحقيقة... وتقول «الآن أفهم».", "~/Images/Books/الان أفهم.webp", 200, 185, "الآن أفهم" },
                    { "36", "Religious", "تقصى الأنباء اليومية المتدفقة وجدل الناس حولها, وتعفب مسلسل الشطحات العقدية والشذوذات الفقهية والتعليقات الفكرية التى تتناسل على شبكات التواصل, والانجرار إلى مطاردة المهاترات الفكرية والقضايا الصغيرة, وتواصل التحديق فى ترقب مماحكاتها ومغايظاتها المتبادلة, والدوران اللاواعى فى مثل هذه الدوامة, وخصوصا بر الهواتف الذكية اللصيقة, يفضى بالمرء إلى الانفصال التدريجى عن روح العمل و تقصى الأنباء اليومية المتدفقة وجدل الناس حولها, وتعفب مسلسل الشطحات العقديةوالشذوذات الفقهية والتعليقات الفكرية التى تتناسل على شبكات التواصل, والانجرار إلى مطاردة المهاترات الفكرية والقضايا الصغيرة, وتواصل التحديق فى ترقب مماحكاتها ومغايظاتها المتبادلة, والدوران اللاواعى فى مثل هذه الدوامة, وخصوصا بر الهواتف الذكية اللصيقة, يفضى بالمرء إلى الانفصال التدريجى عن روح العمل والتنفيذ والانتاج, والشعور بأن المشاهدة والتعليق هى الحالة الطبيعية التى يعيشها طالب العلم والمصلح.\r\nوالمهمة فى معالجة هذا الموضوع مركبة, فنحن بحاجة إلى شخصيات علمية وفكرية ودعوية يكون لها موقف مفصل مدون تجاه إشكالية الإنهماك المفرط فى متابعة الأحداث, بحيث يمكن إعتباره \"نموذجا فكريا\", وفى ذات الوقت نحن مفتقرون إلى معايشة جزء من تجارب هؤلاء لنستثمره فى مداومة أسقام الدافعية التى ولدها الاستغراق فى الماجريات..\r\nوسنحاول فى هذا الكتاب أن نستعرض الحدود الحاكمة لهذه الدراسة, ثم سنتعرض سويا لمنزلة الماجريات فى تصور علماء المسلمين, ثم سننتقل بعد ذلك إلى الماجريات الشبيكية والدراسات الحديثة حولها وعلائق طالب العلم بها. أما الماجريات السياسية فسنحاول فهمها من خلال دراسة نماذج علمية وفكرية جادة ومنتجة كان لها موقف من هذه الإشكالية.", "~/Images/Books/الماجريات.webp", 180, 695, "الماجريات" },
                    { "4", "Literature", "قصة فلسطينية مؤلمة تحكي معاناة ثلاثة رجال في طريق هجرتهم إلى الكويت، بحثًا عن الأمل والهروب من الاحتلال، ليواجهوا مصيرًا مفجعًا داخل صهريج شاحنة.", "~/Images/Books/رجال في الشمس.jpg", 120, 285, "رجال في الشمس" },
                    { "5", "Religious", "كتاب فلسفي رائع يروي رحلة مصطفى محمود الفكرية من الإنكار إلى الإيمان، بأسلوب عميق مليء بالتساؤلات والبحث عن الحقيقة.", "~/Images/Books/رحلتي من الشك إلى الإيمان.jpg", 160, 195, "رحلتي من الشك إلى الإيمان" },
                    { "6", "Religious", "رحلة تفسيرية متميزة تركز على الجوانب الفكرية والفلسفية للقرآن الكريم، وتقدم فهمًا عميقًا للآيات بعيدًا عن التقليدية.", "~/Images/Books/رقائق القرآن.webp", 300, 250, "رقائق القرآن" },
                    { "7", "Literature", "حكاية بوليسية شيقة تدور في أروقة البنوك والمؤامرات المالية، حيث تكشف الأحداث عن لعبة ضخمة من الخداع والسرقة في عالم المصارف.", "~/Images/Books/رواية_العنكبوت.jpg", 410, 100, "رواية العنكبوت" },
                    { "8", "Religious", "من أهم كتب الحديث الشريف، يجمع بين الأخلاق والعبادات في أحاديث نبوية مختارة بعناية لتربية النفس وتزكيتها.", "~/Images/Books/مسلكيات.jpeg", 500, 320, "مسلكيات" },
                    { "9", "Religious", "كتاب صوفي عميق للإمام ابن القيم، يشرح فيه منازل السائرين إلى الله في طريق العبودية، بلغة قوية وعقيدة سليمة.", "~/Images/Books/مدارج السالكين.jpg", 600, 550, "مدارج السالكين" }
                });

            migrationBuilder.InsertData(
                table: "BookAuthors",
                columns: new[] { "AuthorId", "BookId" },
                values: new object[,]
                {
                    { "1", "10" },
                    { "1", "11" },
                    { "1", "12" },
                    { "1", "13" },
                    { "1", "14" },
                    { "1", "34" },
                    { "1", "35" },
                    { "10", "27" },
                    { "11", "32" },
                    { "12", "28" },
                    { "13", "29" },
                    { "14", "30" },
                    { "14", "31" },
                    { "15", "4" },
                    { "2", "5" },
                    { "2", "7" },
                    { "3", "36" },
                    { "3", "6" },
                    { "3", "8" },
                    { "3", "9" },
                    { "4", "1" },
                    { "4", "2" },
                    { "4", "3" },
                    { "4", "33" },
                    { "5", "15" },
                    { "5", "16" },
                    { "5", "17" },
                    { "5", "18" },
                    { "5", "19" },
                    { "5", "20" },
                    { "6", "21" },
                    { "6", "22" },
                    { "7", "23" },
                    { "8", "24" },
                    { "8", "25" },
                    { "9", "26" }
                });

            migrationBuilder.CreateIndex(
                name: "IX_AspNetRoleClaims_RoleId",
                table: "AspNetRoleClaims",
                column: "RoleId");

            migrationBuilder.CreateIndex(
                name: "RoleNameIndex",
                table: "AspNetRoles",
                column: "NormalizedName",
                unique: true,
                filter: "[NormalizedName] IS NOT NULL");

            migrationBuilder.CreateIndex(
                name: "IX_AspNetUserClaims_UserId",
                table: "AspNetUserClaims",
                column: "UserId");

            migrationBuilder.CreateIndex(
                name: "IX_AspNetUserLogins_UserId",
                table: "AspNetUserLogins",
                column: "UserId");

            migrationBuilder.CreateIndex(
                name: "IX_AspNetUserRoles_RoleId",
                table: "AspNetUserRoles",
                column: "RoleId");

            migrationBuilder.CreateIndex(
                name: "EmailIndex",
                table: "AspNetUsers",
                column: "NormalizedEmail");

            migrationBuilder.CreateIndex(
                name: "UserNameIndex",
                table: "AspNetUsers",
                column: "NormalizedUserName",
                unique: true,
                filter: "[NormalizedUserName] IS NOT NULL");

            migrationBuilder.CreateIndex(
                name: "IX_BookAuthors_BookId",
                table: "BookAuthors",
                column: "BookId");

            migrationBuilder.CreateIndex(
                name: "IX_BookCart_CartsId",
                table: "BookCart",
                column: "CartsId");

            migrationBuilder.CreateIndex(
                name: "IX_Carts_CustomerId",
                table: "Carts",
                column: "CustomerId",
                unique: true);

            migrationBuilder.CreateIndex(
                name: "IX_Comments_BookId",
                table: "Comments",
                column: "BookId");
        }

        /// <inheritdoc />
        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DropTable(
                name: "AspNetRoleClaims");

            migrationBuilder.DropTable(
                name: "AspNetUserClaims");

            migrationBuilder.DropTable(
                name: "AspNetUserLogins");

            migrationBuilder.DropTable(
                name: "AspNetUserRoles");

            migrationBuilder.DropTable(
                name: "AspNetUserTokens");

            migrationBuilder.DropTable(
                name: "BookAuthors");

            migrationBuilder.DropTable(
                name: "BookCart");

            migrationBuilder.DropTable(
                name: "Comments");

            migrationBuilder.DropTable(
                name: "AspNetRoles");

            migrationBuilder.DropTable(
                name: "Authors");

            migrationBuilder.DropTable(
                name: "Carts");

            migrationBuilder.DropTable(
                name: "Books");

            migrationBuilder.DropTable(
                name: "AspNetUsers");
        }
    }
}
