using Bookstore.Models;
using Microsoft.EntityFrameworkCore;
using Microsoft.EntityFrameworkCore.Metadata.Builders;

namespace Bookstore.Configuration
{
    public class AuthorConfiguration : IEntityTypeConfiguration<Author>
    {
        public void Configure(EntityTypeBuilder<Author> builder)
        {
            builder.HasKey(author => author.Id);
            builder.Property(author => author.Name).HasColumnType("nVarChar(50)");
            builder.Property(author => author.About).HasColumnType("nvarchar(max)");
            builder.Property(author => author.ImageURL).HasColumnType("nvarchar(50)");

            builder.HasData(AuthorsData());
        }

        private List<Author> AuthorsData()
        {
            return new List<Author>()
            {
                new Author {Id=1, Name ="أحمد خالد توفيق", About="هو طبيب وأديب مصري، ويعتبر من أشهر الكتاب في مجال أدب الرعب وأدب الشباب. ولد في مدينة طنطا عاصمة محافظة الغربية في مصر. متزوج وأب لطفلين هما محمد (12 سنة) ومريم (8 سنوات).\r\nتخرج أحمد خالد توفيق في كلية الطب في جامعة طنطا عام 1985 م وحصل على الدكتوراه في طب المناطق الحارة عام 1997 م. يقدم أحمد خالد توفيق ستة سلاسل للروايات وصلت إلى ما يقرب من 236 عددا، وقد قام بترجمة عدد من الروايات الأجنبية ضمن سلسلة روايات عالمية للجيب. كما قدّم الترجمة العربية الوحيدة لرواية نادي القتال (fight club) للروائي الأمريكي تشاك بولانيك. كما أن له بعض التجارب الشعرية.\r\nوتُوفى إلى رحمة الله تعالى عن عمر يناهز 55 عامًا أثر أزمة صحية ألمت به(عليه رحمة الله تعالى وأسكنه الله فسيح جناته وأبدله سيئاته حسنات إن شاء الله)",ImageURL="~/images/Authors/أحمد_خالد_توفيق.jpg"},
                new Author {Id=2, Name = "مصطفى محمود",About=" عاش مصطفى محمود في مدينة طنطا إلى جوار مسجد السيد البدوي الذي يعد أحد مزارات الصوفية الشهيرة في مصر مما ترك فيه نفسه أثرا واضحا ظهر في توجهاته وأفكاره ولقد تحدث مصطفى محمود عن تكوينه الفكري وعن طفولته التي هي مفتاح ذلك التكوين قائلا : لا اذكر من طفولتي إلا الأحلام التي كنت أتخيل فيها أنى عالم ومخترع أو رحال أو بطل من إبطال التاريخ كما أذكر حبي للموسيقى وللشعر ، وفى صباي تعلمت العزف على الناي وفى شبابي درست العزف على العود ، وكنت أكتب في أيام الدراسة الابتدائية الزجل والشعر وفى الثانوية القصص والمقالات والمسرحيات وهويت العلوم ، وأنشأت معملا للكيمياء والبيولوجيا في بيتى وكنت أحضر الغازات واشرح الضفادع ، نشرت لي أول قصة في مجلة الرسالة عام 1947 ثم بعد ذلك نشرت القصة الثانية في جريدة المصري ، ثم اشتغلت في أخر ساعة وأخبار اليوم وفى عام 1952 كنت احد مؤسسي مجلة التحرير وفى عام 1956 اشتغلت بمجلة روزاليوسف.\r\n\r\nكانت حياتي الأدبية خلال ثلاثين عاما هجرة مستمرة نحو إدراك الحياة والبحث عن الحقيقة وكان كل كتاب محطة على طريق هذا السفر الطويل.\r\n\r\n",ImageURL="~/images/Authors/مصطفى محمود.jpg"},
                new Author {Id=3, Name = "إبراهيم السكران",About="إبراهيم السكران (ولد في 5 ربيع الآخر 1396 هـ الموافق 4 أبريل 1976م) باحث ومُفكِّر إسلامي، مهتمٌ بمنهج الفقه الإسلامي وبالمذاهب العقدية والفكرية، له العديد من المؤلفات والأبحاث والمقالات المنشورة وله عدد من الكتب المطبوعة.\r\n\r\nسيرته\r\nهو أبو عُمر، إبراهيم بن عمر بن إبراهيم السكران المشرف الوهبي التميمي، درس في جامعة الملك فهد للبترول والمعادن سنة واحدة، ثم تركها متوجهًا إلى كلية الشريعة في جامعة الإمام محمد بن سعود الإسلامية بالرياض وتخرج منها، نال درجة الماجستير في السياسة الشرعيّة من المعهد العالي للقضاء التابع لجامعة الإمام محمد بن سعود الإسلامية بالرياض، ثم توجه إلى بريطانيا ونال درجة الماجستير في القانون التجاري الدولي في جامعة إسكس بمدينة كولشيستر.\r\n\r\nظهر تحوّل إبراهيم السكران إلى الفكر السلفي عام 1428 هـ 2007 م في ورقة فكريّة انتشرَت وقتها الكترونيًا، عنوانها: مآلات الخِطاب المدني، وقد أثارت هذه الورقة الكثير من المحسوبين على التيار التنويري.  ",ImageURL="~/images/Authors/إبراهيم السكران.jpeg"},
                new Author {Id=4, Name = "أحمد مراد",About="أحمد مراد أحمد عبسلام (مواليد القاهرة 1978) كاتب ومصور ومصمم جرافيك مصري، تخرّج في مدرسة ليسيه الحرّية بباب اللوق عام 1996 قبل أن يلتحق بالمعهد العالي للسينما ليدرس التصوير السينمائي، وتخرّج عام 2001 بترتيب الأول على القسم، ونالت أفلام تخرّجه \"الهائمون - الثلاث ورقات - وفي اليوم السابع\" جوائز للأفلام القصيرة في مهرجانات بإنجلترا وفرنسا وأوكرانيا.\r\nبدأ مراد كتابة روايته الأولي \"فيرتيجو\" في شتاء عام 2007، ونُشِرت في نفس العام عن دار ميريت قبل أن تُترجم للّغة الإنجليزية عن دار بلومزبيري، ثم للإيطالية عن دار مارسيليو، والفرنسية عن دار فلاماريون، ثم تحولت الرواية لمسلسل تليفزيوني في رمضان من عام 2012 بعنوان فيرتيجو بطولة هند صبري، ونالت الرواية جائزة \"البحر الأبيض المتوسط للثقافة\" لعام 2013 من إيطاليا.\r\nفي فبراير 2010 أصدر مراد روايته الثانية بعنوان \"تراب الماس\" وتُرجمت للإيطالية عن دار مارسيليو وللألمانية، وتم تحويلها لفيلم سينمائي هذا العام 2018.من بطوله اسر ياسين و ماجد الكدوانى.\r\nوفي أكتوبر 2012 صدرت روايته الثالثة \"الفيل الأزرق\" والتي نالت المركز الأول في مبيعات الكتب بمعرض القاهرة الدولي للكتاب 2013، ورشحت الرواية في القائمة القصيرة لجائزة البوكر العربية عام 2014.",ImageURL="~/images/Authors/احمد مراد.jpg"},

            };
        }
    }
}
