using Bookstore.Models;
using Microsoft.EntityFrameworkCore;
using Microsoft.EntityFrameworkCore.Metadata.Builders;

namespace Bookstore.Configuration
{
    public class BookConfiguration : IEntityTypeConfiguration<Book>
    {
        public void Configure(EntityTypeBuilder<Book> builder)
        {
            builder.HasKey(book => book.Id);
            builder.Property(book => book.Id).ValueGeneratedNever();
            builder.Property(book => book.Title).HasColumnType("nVarchar(100)");
            builder.Property(book => book.ImageURL).HasColumnType("nVarchar(100)");
            builder.Property(book => book.Description).HasColumnType("nVarchar(MAX)");
            builder.Property(book => book.Category).HasConversion<string>();

            builder.HasMany(book => book.Authors)
                .WithMany(author => author.Books)
                .UsingEntity<BookAuthor>();

            builder.HasMany(book => book.Comments)
                .WithOne(comment => comment.Book)
                .HasForeignKey(comment => comment.BookId);

            builder.HasMany(book => book.Orders)
                .WithMany(order => order.Books)
                .UsingEntity<OrderItem>();

            builder.HasData(BooksData());
        }

        private List<Book> BooksData()
        {
            return new List<Book>
            {
                new Book{Id = "1", Title="تراب الماس",Category= Category.Literature,ImageURL="~/Images/Books/تراب الماس.webp", NumberOfPages=448,Description="لم يكن \"طه\" سوى مندوب دعاية طبية فى شركة أدوية, حياة باهتة رتيبة, بدلة وكرافتة وحقيبة جلدية ولسان لبق يستميل أعتى الأطباء لأدويته.. كان ذلك قبل أن يسقط..\r\nجريمة قتل غامضة تتركه خلفها وقد تبدل عالمه.. للأبد.. تتحول حياته إلى جزيرة من الأسرار, يبدأ اكتشافها فى دفتر عتيق يعثر عليه مصادفة, ويجد أداة رهيبة لها فعل السحر.. سنقرأ هنا كيف تتحول هذه الجريمة إلى سلسلة من عمليات القتل. وكيف يصبح القتل بابا يكشف لنا عالما من الفساد, وسطوة السلطة التى تمتد لأجيال فى تتابع مثير لا يؤكد أبدا أن \"طه\" سيصل إلى نهايته..", Price = 220},
                new Book{Id = "2", Title="الفيل الأزرق",Category= Category.Literature,ImageURL="~/Images/Books/Al-Feel_al-Azraq.jpg",NumberOfPages=485,Description="الرواية فانتازية خيالية تدور أحداثها حول دكتور للأمراض العقلية يدعى - يحيى - كان يعمل في مستشفى العباسية ، كان مدمنا للخمر وتعرض لحادث أدى إلى وفاة زوجته وابنته ، فانعزل عن العالم لمدة خمس سنوات وبعد انقطاع عن العمل عاد مرة أخرى للعمل في نفس المستشفى إلا أنه يتفاجأ بوجود صديق قديم يدعى - شريف - وهو نزيل بالمستشفى كان له ماضي أراد أن ينساه طويلا إلا أنه وقع تحت رحمة يحيى ، فتنقلب حياة يحيى وصديقه راسا على عقب حيث يبدأ يحيى بالتنقيب والبحث عن حقيقة صديقه عبرة رحلة استكشافية مثيرة مليئة بالعالم الغريب والخيالي ليظهر بها الكاتب الخبايا النفسية للبشر وغرائبها .", Price = 310},
                new Book{Id = "3", Title="1919",Category= Category.Literature,ImageURL="~/Images/Books/1919.jpeg",NumberOfPages=485,Description="سيختطفك أحمد مراد في آلة زمن، ليهبط بك في حقبة تغلي فيها القاهرة بالأحداث.. وثبة زمنية إلى عالم متشابك يمسك المؤلف مقتدرًا بكل مفاتيحه؛ بين سعد زغلول وتعنت البريطانيين، قصة الوفد ومقهى \"متاتيا\" جماعة سرية تعمل تحت مقهى \"ريش\"، وعوالم البغاء المقنن.. شخصيات عديدة سوف تتعاطف معها أو تمقتها، أو تفعل الشيئين بلا تحفظ، بحوار مفعم بالحيوية حتى لتوشك على سماعه يتردد في أذنك، وتفاصيل تاريخية مضنية ودقيقة. سوف تدرك أن البعض ما زال مصرًّا على الجدية والإتقان.", Price = 330},
                new Book
    {
        Id = "4",
        Title = "رجال في الشمس",
        Category = Category.Literature,
        ImageURL = "~/Images/Books/رجال في الشمس.jpg",
        NumberOfPages = 120,
        Description = "قصة فلسطينية مؤلمة تحكي معاناة ثلاثة رجال في طريق هجرتهم إلى الكويت، بحثًا عن الأمل والهروب من الاحتلال، ليواجهوا مصيرًا مفجعًا داخل صهريج شاحنة.",
        Price = 285
    },
    new Book
    {
        Id = "5",
        Title = "رحلتي من الشك إلى الإيمان",
        Category = Category.Religious,
        ImageURL = "~/Images/Books/رحلتي من الشك إلى الإيمان.jpg",
        NumberOfPages = 160,
        Description = "كتاب فلسفي رائع يروي رحلة مصطفى محمود الفكرية من الإنكار إلى الإيمان، بأسلوب عميق مليء بالتساؤلات والبحث عن الحقيقة.",
        Price = 195
    },
    new Book
    {
        Id = "6",
        Title = "رقائق القرآن",
        Category = Category.Religious,
        ImageURL = "~/Images/Books/رقائق القرآن.webp",
        NumberOfPages = 300,
        Description = "رحلة تفسيرية متميزة تركز على الجوانب الفكرية والفلسفية للقرآن الكريم، وتقدم فهمًا عميقًا للآيات بعيدًا عن التقليدية.",
        Price = 250
    },
    new Book
    {
        Id = "7",
        Title = "رواية العنكبوت",
        Category = Category.Literature,
        ImageURL = "~/Images/Books/رواية_العنكبوت.jpg",
        NumberOfPages = 410,
        Description = "حكاية بوليسية شيقة تدور في أروقة البنوك والمؤامرات المالية، حيث تكشف الأحداث عن لعبة ضخمة من الخداع والسرقة في عالم المصارف.",
        Price = 100
    },
    new Book
    {
        Id = "8",
        Title = "مسلكيات",
        Category = Category.Religious,
        ImageURL = "~/Images/Books/مسلكيات.jpeg",
        NumberOfPages = 500,
        Description = "من أهم كتب الحديث الشريف، يجمع بين الأخلاق والعبادات في أحاديث نبوية مختارة بعناية لتربية النفس وتزكيتها.",
        Price = 320
    },

    new Book
    {
        Id = "9",
        Title = "مدارج السالكين",
        Category = Category.Religious,
        ImageURL = "~/Images/Books/مدارج السالكين.jpg",
        NumberOfPages = 600,
        Description = "كتاب صوفي عميق للإمام ابن القيم، يشرح فيه منازل السائرين إلى الله في طريق العبودية، بلغة قوية وعقيدة سليمة.",
        Price = 550
    },
        new Book
    {
        Id = "10",
        Title = "حكايات الغرفة 207",
        Category = Category.Literature,
        ImageURL = "~/Images/Books/حكايات الغرفة 207.webp",
        NumberOfPages = 200,
        Description = "مجموعة قصصية مشوقة تدور أحداثها داخل غرفة غامضة تحمل أسرارًا لا تنتهي، حيث يصبح الدخول إليها تجربة تغير حياة كل من يقترب منها.",
        Price = 190
    },
    new Book
    {
        Id ="11",
        Title = "عقل بلا جسد",
        Category = Category.Literature,
        ImageURL = "~/Images/Books/عقل بلا جسد.webp",
        NumberOfPages = 190,
        Description = "رحلة فكرية مرعبة في دهاليز العقل والروح، تجمع بين التشويق والخيال العلمي، بأسلوب فلسفي عميق يلامس النفس الإنسانية.",
        Price = 195
    },
    new Book
    {
        Id = "12",
        Title = "رفقاء الليل",
        Category = Category.Literature,
        ImageURL = "~/Images/Books/رفقاء الليل.webp",
        NumberOfPages = 240,
        Description = "مجموعة من القصص القصيرة التي تستعرض مواقف إنسانية في ظلال الليل، حيث تتجلى مشاعر الوحدة والخوف والحنين.",
        Price = 185
    },
    new Book
    {
        Id ="13",
        Title = "في ممر الفئران",
        Category = Category.Literature,
        ImageURL = "~/Images/Books/في ممر الفئران.webp",
        NumberOfPages = 310,
        Description = "كتاب تاريخي يقدم عرضًا مبسطًا وممتعًا لحياة المصريين القدماء، وعاداتهم، وعلومهم، وأسلوب حياتهم اليومي.",
        Price = 210
    },
    new Book
    {
        Id = "14",
        Title = "يوتوبيا",
        Category = Category.Literature,
        ImageURL = "~/Images/Books/يوتوبيا.webp",
        NumberOfPages = 172,
        Description = "رواية سوداوية عن مستقبل مرعب، تتخيل انقسام المجتمع المصري إلى طبقتين: الأغنياء في الجنة والطبقة المسحوقة في الجحيم، في إطار درامي فلسفي.",
        Price = 295
    },
      new Book
        {
            Id = "15",
            Title = "شرح ثلاثة الأصول ",
            Category = Category.Religious,
            ImageURL = "~/Images/Books/شرح ثلاثة الأصول.webp",
            NumberOfPages = 200,
            Description="كتاب في العقيدة الاسلامية شرح فيه المؤلف أهم الركائز والاسس الايمانية والاعتقادية التي بني عليها الاسلام، وهو يقدم هذه الاصول بأسلوب واضح ومختصر ليسهل على .المتلقي فهمه",
            Price = 185
        },
      new Book
{
    Id = "16",
    Title = "شرح الأربعين النووية",
    Category = Category.Religious,
    ImageURL = "~/Images/Books/شرح الأربعين النووية.webp",
    NumberOfPages = 230,
    Description = "يُعتبر كتاب 'شرح الأربعين النووية' من أهم الشروحات على متن الإمام النووي، الذي جمع فيه أربعين حديثًا نبوياً تُعد من جوامع الكلم. يتناول هذا الشرح كل حديث بالتفصيل من حيث معناه اللغوي والشرعي، وأسباب وروده، وربطه بواقع المسلم اليوم. كما يسلط الضوء على ما يستفيده المسلم من كل حديث في سلوكه وعقيدته، مع الوقوف على الأحكام الفقهية والعبر التربوية التي يتضمنها النص النبوي. يُعد هذا الكتاب بوابة مهمة لفهم السنة النبوية وبناء شخصية مسلمة متزنة.",
    Price = 595
},

new Book
{
    Id = "17",
    Title = "شرح ألفية ابن مالك",
    Category = Category.Religious,
    ImageURL = "~/Images/Books/شرح ألفية ابن مالك.webp",
    NumberOfPages = 480,
    Description = "يتناول هذا الشرح تفصيلًا دقيقًا لألفية الإمام ابن مالك، وهي منظومة نحوية تُعد من أشهر المتون في علم النحو. الشرح لا يقتصر فقط على القواعد، بل يربطها بالتطبيقات العملية في اللغة العربية، مما يجعله مرجعًا لغويًا عظيمًا للطلاب والباحثين. يمتاز أسلوب الشارح بالسلاسة والوضوح، ويعرض المسائل النحوية بأمثلة من القرآن والسنة والشعر العربي، مما يسهم في ترسيخ القاعدة في ذهن الطالب بأسلوب علمي رصين.",
    Price = 630
},

new Book
{
    Id = "18",
    Title = "شرح رياض الصالحين",
    Category = Category.Religious,
    ImageURL = "~/Images/Books/شرح رياض الصالحين.webp",
    NumberOfPages = 600,
    Description = "رياض الصالحين هو كتاب جمع فيه الإمام النووي أحاديث منتقاة تتناول مكارم الأخلاق والآداب الإسلامية. ويأتي هذا الشرح ليجعل من هذه الأحاديث منارة سلوكية وتربوية في حياة المسلم، حيث يبين معانيها ومقاصدها ويوضح كيف يمكن تطبيقها في الواقع المعاصر. يعتني الشارح بالربط بين الحديث والسلوك اليومي، ويضيف فوائد فقهية وتربوية تسهم في بناء شخصية إيمانية متكاملة تقوم على الإحسان والخلق الحسن.",
    Price = 750
},

new Book
{
    Id = "19",
    Title = "شرح صحيح البخاري",
    Category = Category.Religious,
    ImageURL = "~/Images/Books/شرح صحيح البخاري.webp",
    NumberOfPages = 1200,
    Description = "صحيح البخاري هو أصح كتاب بعد كتاب الله، وشروحه تُعد من أعظم ما كُتب في علم الحديث. وهذا الشرح يُقدم تفسيرًا دقيقًا للأحاديث من جوانب متعددة: فقهية، لغوية، وسياقية، مع تحليل للأسناد وبيان للعلل والروايات. يربط بين فقه الحديث وأقوال العلماء، ويوضح المسائل الخلافية بعمق، مما يجعله مصدرًا لا غنى عنه لطالب العلم في فهم الحديث النبوي الشريف وتطبيقه في مختلف مجالات الحياة.",
    Price = 830
},

new Book
{
    Id = "20",
    Title = "مصطلح الحديث",
    Category = Category.Religious,
    ImageURL = "~/Images/Books/مصطلح الحديث.webp",
    NumberOfPages = 310,
    Description = "كتاب 'مصطلح الحديث' يُعد مدخلاً أساسيًا لفهم علوم الحديث الشريف، حيث يشرح مصطلحات المحدثين مثل: الصحيح، الحسن، الضعيف، المرسل، المعضل وغيرها. يوضح قواعد قبول ورد الحديث، ويُعرّف بأنواع العلل والسند والرواة. بأسلوب تعليمي منظم، يساعد الطالب على التمييز بين درجات الأحاديث وفهم المنهج النقدي عند علماء الحديث. هو حجر أساس لفهم السنة النبوية بعلم ودراية وتمييز بين الغث والسمين في الروايات.",
    Price = 410
},
new Book
{
    Id ="21",
    Title = "العادات السبع للناس الأكثر فعالية",
    Category = Category.SelfDevelopment,
    ImageURL = "~/Images/Books/العادات-السبع-للناس-الأكثر-فعالية-1425-250x375-webp.webp",
    NumberOfPages = 350,
    Description = "العادات السبع للناس الأكثر فعالية بقلم ستيفن آر. كوفي ... نظراً لكون هذا الكتاب من أكثر الكتب المؤلفة إلهاماً وتأثيراً، فقد أسر القراء طوال الخمسة والعشرين عاماً الماضية، وقد حول حياة عدد من الرؤساء وكبار المديرين التنفيذيين والمحاضرين والآباء. فنقول بإيجاز إنه حول حياة ملايين الأشخاص من مختلف الأعمار والوظائف. ومن حين لآخر يظهر لنا كتاب لا يغير حياة القراء وحسب، بل يترك أثراً في الثقافة ذاتها، وهذا الكتاب ينتمي إلى هذه الفئة.",
    Price = 240
},
new Book
{
    Id = "22",
    Title = "العادات السبع للمراهقين الأكثر فعالية",
    Category = Category.SelfDevelopment,
    ImageURL = "~/Images/Books/العادات-السبع-للمراهقين-الأكثر-فعالية-1424-250x375-webp.webp",
    NumberOfPages = 280,
    Description = "العادات السبع للمراهقين الأكثر فعالية بقلم شين كوفي ... هذا الكتاب مليء بالقصص المدهشة يرويها مراهقون اليوم عن أنفسهم، وهي قصص كتبت بدوافع عديدة مثل الغضب والإحباط والمرح والحماس والوحدة والنجاح والأمل والإلهام. الرسوم الكرتونية والأفكار والاقتباسات التي يحتويها الكتاب تجعله مثيراً وجذاباً وملائماً للموضوع من الغلاف إلى الغلاف. وبالإضافة إلى هذا، فإن الكتاب يضع دليلاً مفصلاً خطوة بخطوة يساعد المراهقين على بناء صورة الذات وعلاقات الصداقة ومقاومة ضغط النظراء وتعلمهم كيفية تحقيق أهدافهم طويلة الأجل.",
    Price = 220
},
new Book
{
    Id = "23",
    Title = "العادات الذرية",
    Category = Category.SelfDevelopment,
    ImageURL = "~/Images/Books/العادات-الذرية-608-250x375-webp.webp",
    NumberOfPages = 320,
    Description = "العادات الذرية بقلم جيمس كلير ... أيّاً كانت أهدافك، فإن كتاب \"العادات الذرية\" يقدم لك إطار عمل من أجل تطوير مهاراتك في كل يوم. جيمس كلير واحد من أبرز الخبراء في مجال اكتساب العادات، يوضح لنا في كتابه هذا استراتيجيات عملية تعلمنا كيف نستطيع اكتساب عادات جيدة، وكيف نتخلص من القديمة السلبية، ويشرح لنا طريقة إدارة وإتقان أفعالنا اليومية البسيطة التي نستطيع من خلالها تحقيق نتائج مذهلة. يعلمنا هذا الكتاب: كيف نخلق الوقت من أجل اكتساب عادات جديدة، كيف نتخلص من نقص الحافز، ونتمتع بقوة الإرادة، كيف نغير بيئتنا المحيطة لتحقيق نتائج إيجابية في الحياة.",
    Price = 230
},
new Book
{
    Id = "24",
    Title = "خراب: كتاب عن الأمل",
    Category = Category.SelfDevelopment,
    ImageURL = "~/Images/Books/خراب-كتاب-عن-الأمل-2159-250x375-webp.webp",
    NumberOfPages = 240,
    Description = "خراب (كتاب عن الأمل) بقلم مارك مانسون ... هل تساءلت يوماً لماذا يبدو أن ازدياد إمكانية التواصل بين الناس يجعلهم أكثر تباغضاً؟ وهل تساءلت يوماً عما يجعل الناس يشعرون أنهم أكثر قلقاً وتعاسة على الرغم من ازدياد حياتهم يسراً؟ حسناً، شدوا الأحزمة! سوف يأخذكم العم مارك في رحلة جديدة! ومثلما شكك كتابه «فن اللامبالاة» في حكمتنا التقليدية المعتادة حول ما يجعلنا سعداء، يأتي كتاب «خراب: كتاب عن الأمل» ليضع موضع التساؤل كل ما لدينا من افتراضات عما يجعل الحياة جديرة بأن تُعاش. إننا نعيش زمناً لافتاً! فمن الناحية المادية، صار كل شيء أفضل من أي وقت مضى - نحن الآن أكثر حرية وبحبوحة من أي جيل سابق في تاريخ البشر. لكن كل شيء يبدو - لسبب ما - كما لو أنه سيء إلى حد فظيع لا يمكن تداركه. ففي هذه اللحظة من لحظات التاريخ، حين صار في متناولنا ما لم يحلم به أسلافنا من تعليم وتكنولوجيا واتصالات، يعود كثير منا فيجد نفسه تحت وطأة إحساس طاغ بانعدام الأمل. فما الأمر؟ هذا ما يحاول مارك مانسون إخراجنا منه. نشر مانسون كتابه «فن اللامبالاة» في سنة 2016، فحقق نجاحاً لامعاً في تحديد معالم القلق الخفي المستمر الذي يتخلل الحياة الحديثة. لقد بين لنا أن ما خلقته حياتنا الحديثة في نفوسنا من دافع لا يهدأ إلى السعي الدائم خلف السعادة لا يفلح إلا في جعلنا أقل سعادة من ذي قبل. وقد كانت النتيجة كتاباً تحول إلى ظاهرة عالمية فباع ملايين النسخ في أنحاء الأرض واحتل المركز الأول في ثلاثة عشر بلداً. والآن، مع «خراب: كتاب عن الأمل»، يحوّل مانسون نظره من العيوب التي لا مهرب منها في نفس كل فرد إلى الكوارث التي لا نهاية لها في العالم من حولنا. يعتمد مانسون على ميدان أبحاث علم النفس في هذه الموضوعات، وعلى الأفكار الحكيمة الخالدة للعديد من الفلاسفة، فيشرح السياسة والدين وعلاقاتنا بالمال والإنترنت وعالم التسلية، وكيف يمكن للإفراط في أشياء جيدة أن يأكلنا أحياء من الناحية النفسية، وهو يتحدى من غير مواربة تعريفاتنا للإيمان والسعادة والحرية، بل حتى للأمل نفسه.",
    Price = 225
},
new Book
{
    Id = "25",
    Title = "فن اللامبالاة: لعيش حياة تخالف المألوف",
    Category = Category.SelfDevelopment,
    ImageURL = "~/Images/Books/فن-اللامبالاة-لعيش-حياة-تخالف-المألوف-2160-250x375-webp.webp",
    NumberOfPages = 260,
    Description = "فن اللامبالاة (لعيش حياة تخالف المألوف) بقلم مارك مانسون ... ظل يُقال لنا طيلة عشرات السنوات إن التفكير الإيجابي هو المفتاح إلى حياة سعيدة ثرية. لكن مارك مانسون يشتم تلك \"الإيجابية\" ويقول: \"فلنكن صادقين، السيء سيء وعلينا أن نتعايش مع هذا\". لا يتهرّب مانسون من الحقائق ولا يغلفها بالسكّر، بل يقولها لنا كما هي: جرعة من الحقيقة الفجِّة الصادقة المنعشة هي ما ينقصنا اليوم. هذا الكتاب ترياق للذهنية التي نهدهد أنفسنا بها، ذهنية \"فلنعمل على أن يكون لدينا كلنا شعور طيب\" التي غزت المجتمع المعاصر فأفسدت جيلاً بأسره صار ينال ميداليات ذهبية لمجرد الحضور إلى المدرسة. ينصحنا مانسون بأن نعرف حدود إمكاناتنا وأن نتقبلها. وأن ندرك مخاوفنا ونواقصنا وما لسنا واثقين منه، وأن نكفّ عن التهرب والفرار من ذلك كله ونبدأ مواجهة الحقائق الموجعة، حتى نصير قادرين على العثور على ما نبحث عنه من جرأة ومثابرة وصدق ومسؤولية وتسامح وحب للمعرفة. لا يستطيع كل شخص أن يكون متميزاً متفوقاً. ففي المجتمع ناجحين وفاشلين؛ وقسم من هذا الواقع ليس عادلاً وليس نتيجة غلطتك أنت. وصحيح أن المال شيء حسن، لكن اهتمامك بما تفعله بحياتك أحسن كثيراً؛ فالتجربة هي الثروة الحقيقية.",
    Price = 215
},
new Book
{
    Id = "26",
    Title = "الكاتب وأشباحه",
    Category = Category.Miscellaneous,
    ImageURL = "~/Images/Books/الكاتب-وأشباحه-45805-250x375-webp.webp",
    NumberOfPages = 254,
    Description = "الكاتب وأشباحه بقلم إرنستو ساباتو ... يتضمن هذا الكتاب تنويعات على الموضوع نفسه، وهو موضوع طالما استحوذ على تفكيري منذ أن شرعت في الكتابة: لماذا، وكيف، وما الغرض من كتابة الأدب؟ ولقد طرحت أنا نفسي هذه الأسئلة عدداً لا يحصى من المرات، كما طرحها عليّ قراء وصحفيون؛ لأدرك في كلّ مرة من هذه المرات الدوافع الخفية التي تحمل إنساناً على الكتابة، بصورة جادة إلى حدّ الهوس، عن أشخاص وأحداث لا تنتمي إلى عالم الواقع، ويبدو أنها، بالرغم من ذلك، قدّمت، بآليةٍ شديدة الغرابة، الشهادة الأكثر أصالة عن الواقع المعاصر.",
    Price = 105
},
new Book
{
    Id = "27",
    Title = "النص والسلطة والمجتمع",
    Category = Category.Miscellaneous,
    ImageURL = "~/Images/Books/النص-والسلطة-والمجتمع-2-52185-250x375-webp.webp",
    NumberOfPages = 324,
    Description = "النص والسلطة والمجتمع (القيم السياسية في الرواية العربية) بقلم عمار علي حسن ... يُقيمُ هذا الكتابُ جسراً عريضاً بين الأدب وعلم السياسة دونَ أن يجعل الأوَّلَ في خدمة الثاني أو مَطيَّةً له، فهذا يُحوِّل النصوص الأدبية، روائية وقصصية وشعرية ومسرحية، إلى بيانٍ أو منشورٍ أو أيديولوجيا، بما يجرح جمالها الفنِّي بل يقتله أحياناً، إنما هو يدرس، عبر عشرين روايةً عربية، قيَم الحُريَّة والعدل والمساواة والانتماء، بعد تمهيدٍ نظريّ تناول النصَّ الأدبي من الخارج، فأظهرَ تأثير النظام السياسي والأيديولوجيَّات والظروف الاقتصاديَّة وأفعال السُّلْطة وأحوال المجتمع على الأدب، ثم من الداخل مُستخدماً مختلف نظريَّات النقد الأدبيّ في تحليل النصوص من النواحي الجماليَّة والشكليَّة، وكل ما تنطوي عليه من علاماتٍ وإشارات. والكتابُ هو أطروحةُ الدكتوراه في العلوم السياسيَّة لمُؤلِّفه ناقشها عام 2001، وصدرت منه عدَّةُ طبعات، ورغم أنه عملٌ أكاديميٌّ فقد صِيغَ بأسلوبٍ سَلِس، يحافظ على دقَّة الكتابة العلميَّة، وفي الوقت نفسه، يمتثلُ لضرورة وصول المعنى إلى أغلب الناس، سواء المُهتمِّين بدراسة الأدب ومتابعته وقراءته وتذوُّقه أم المُختصِّين في العلوم الإنسانيَّة، أو حتى القارئ العاديّ الراغب في تعزيز ثقافته، وتعميق فهمه.",
    Price = 210
},
new Book
{
    Id = "28",
    Title = "أساطير عربية 1",
    Category = Category.History,
    ImageURL = "~/Images/Books/أساطير-عربية-1-53295-250x375-webp.webp",
    NumberOfPages = 352,
    Description = "أساطير عربية 1 بقلم إسماعيل مرسي ... على الرَّغْمِ مِنْ كَونِنَا في عَصرِ المادَّةِ والتقدم التكنولوجي، إلا أن سحر ومتعة الأساطير لم يفقدا بريقهما وتأثِيرَهُمَا، فَمِنْ خلال سطورها ننتقل عبر حدود الزمان والمكان وإلى ما وراء العقل كذلك؛ فتخوض بنا عُباب بحور الدُّنيا ومحيطاتها، وتهيم بنا في براريها، وتصعد بنا الجبال، وتهبط بنا السهول والوديان، وتطوف بنا في أقطار الأرض شرقها وغربها، وتحلّق بنا في سمواتها وتجول بنا بين كواكبها، وتذكرُ لنَا طُرَفاً مِنْ غرائب سُكّان الأرض وطبائعهم، وعجائب ما عملوا وغريب ما صنعوا، واختلاف أخلاقهم شرها وخيرها، فنجد فيها العظة والإرشاد والتجربة. وبعد أن قدمنا لقارئنا الكريم كتاب أساطير الإغريقية، التي لاقت استحساناً كبيراً مِنَ القُراء؛ قررْنَا أن نقدم لهم الأساطير العربية؛ فهي لا تقل تميزاً ولا لذَّةً عَن تلك الأساطير المشهورة ... فانتقينا من بين عشرات الكتب تلك الباقة التي بين يديك.",
    Price = 200
},
new Book
{
    Id = "29",
    Title = "الأندلس: درة التاريخ الإسلامي - الفردوس المفقود",
    Category = Category.History,
    ImageURL = "~/Images/Books/الأندلس-درة-التاريخ-الإسلامي-الفردوس-المفقودة-55627-250x375-webp.webp",
    NumberOfPages = 454,
    Description = "كتاب تاريخي شامل يتناول تاريخ الأندلس الإسلامية، حضارتها، وإنجازاتها العلمية والثقافية.",
    Price = 230
},
new Book
{
    Id = "30",
    Title = "عصر التنظيمات والإصلاحات العثمانية",
    Category = Category.History,
    ImageURL = "~/Images/Books/عصر-التنظيمات-والإصلاحات-العثمانية-55652-250x375-webp.webp",
    NumberOfPages = 380,
    Description = "دراسة تاريخية مفصلة عن فترة الإصلاحات العثمانية وتأثيرها على الدولة والمجتمع.",
    Price = 220
},
new Book
{
    Id = "31",
    Title = "أزمات الحكم في الدولة العثمانية",
    Category = Category.History,
    ImageURL = "~/Images/Books/أزمات-الحكم-في-الدولة-العثمانية-2-55722-250x375-webp.webp",
    NumberOfPages = 320,
    Description = "تحليل تاريخي لأزمات الحكم في الدولة العثمانية وأسبابها وتأثيراتها على مسار الدولة.",
    Price = 215
},
new Book
{
    Id = "32",
    Title = "مقدمة ابن خلدون (مجلد هارد كوفر)",
    Category = Category.History,
    ImageURL = "~/Images/Books/مقدمة-ابن-خلدون-5-49901-250x375-webp.webp",
    NumberOfPages = 500,
    Description = "مقدمة ابن خلدون (مجلد هارد كوفر) بقلم ابن خلدون ... في عام 1377م، خطَّ ابن خلدون كتابه \"مقدمة ابن خلدون\"، لتكون مفتاحاً ومقدمةً لأحد أضخم المؤلفات التاريخية \"كتاب العبر\". غير أن هذه المقدمة، التي حملت بذورَ المعرفة الكثيرة، أصبحت لاحقاً مؤلفاً مستقلّاً في ذاته، موسوعيّاً في محتواه، إذ غَصَّت بين طياته ميادين العلم كلها، من الشريعة والتاريخ والجغرافيا، إلى الاقتصاد والعمران والاجتماع والسياسة والطب. كان ابن خلدون في مقدمته كعالم فلكي يدرس حركة النجوم في السماء، فدرس أحوال البشر واختلافات طبائعهم، كما يدرس تأثير البيئة في الإنسان، كأنما هو طبيب اجتماعي يعكف على تشخيص الأمراض التي تصيب الأمم. وفي هذا الكتاب، سبق ابن خلدون غيره من المفكرين إلى العديد من الآراء والأفكار العميقة التي كانت بمنزلة إشعاعات جديدة تنير درب المعرفة. وقد اعتُبر بذلك مؤسساً لعلم الاجتماع، متفوقاً على الفيلسوف الفرنسي أوغست كونت، الذي جاء بعده بقرون عديدة.",
    Price = 560
},
new Book
{
    Id = "33",
    Title = "فيرتيجو",
    Category = Category.Literature,
    ImageURL = "~/Images/Books/فيرتيجو.webp",
    NumberOfPages = 280,
    Description = "فيرتيجو بقلم أحمد مراد ... «رواية ڨيرتيجو مغامرةٌ تستحق التشجيع لأن كاتبها – على حداثة عهده بالكتابة – لديه معرفةٌ عميقةٌ بتقنيات الكتابة الروائية من حيث هي عملية فنية بالأساس، هذا إلى جانب تَمتُّعه بحسٍّ عالٍ مَكَّنه من تحليل مُكونات المجتمع المصري الحالي.» صنع الله إبراهيم. الصدفة البحتة هي التي جعلت مُصوّرَ الأفراح الشاب أحمد كمال يلتقط صوراً لمعركة دموية بين كبار رجال الأعمال في مصر في بار «ڨيرتيجو» الشهير والذي يرتاده صفوة المجتمع، فيتحوّل المكانُ في ثوانٍ إلى بركة من الدماء والجثث... ويضطر أحمد إلى الهرب من القتلة والاختباء ليبدأ رحلةً لا تُصدَّق؛ تكشف العديد من الأسرار والفضائح التي يحاول أصحابُها التَّكتمَ عليها بأي ثمنٍ. لعبةٌ سياسيةٌ واسعةُ النطاق يواجهها أحمد ضد حيتان لا تَرحم... لعبةٌ للخسارة فيها ثمنٌ وحيدٌ... حياته... روايةٌ مثيرةٌ كشفتِ الواقعَ المصري اليوم، ونالت استحسانَ النقاد والقرَّاء في مصر والعالم.",
    Price = 210
},
new Book
{
    Id = "34",
    Title = "حظك اليوم",
    Category = Category.Literature,
    ImageURL = "~/Images/Books/حظك اليم.webp",
    NumberOfPages = 220,
    Description = "حظك اليوم بقلم أحمد خالد توفيق... اثنا عشر برجاً، اثنتا عشرة طريقة للموت، ولعنة تطاردك في كل صوب. تمر بالأطوار المعتادة: في البداية أنت لا تعرف... بعد هذا أنت لا تلاحظ... ثم تلاحظ فلا تصدق... ثم تصدق فلا تعرف ما ينبغي عمله. يقول الغربيون أنك لا يمكن أن تكون حذراً أكثر من اللازم. وهذه القصص تطبيق عملي صادق لصحة هذه المقولة.",
    Price = 190
},
new Book
{
    Id = "35",
    Title = "الآن أفهم",
    Category = Category.Literature,
    ImageURL = "~/Images/Books/الان أفهم.webp",
    NumberOfPages = 200,
    Description = "هي 13 قصة قصيرة... بينها كلها عامل مشترك... هو وضوح الفكرة في النهاية... تنساق القصة في انسيابية وسلاسة حتى تدرك من الجاني... ما السبب... وكيف حدث ما حدث... في النهاية وقتها فقط تدرك الحقيقة... وتقول «الآن أفهم».",
    Price = 185
},
new Book
{
    Id = "36",
    Title = "الماجريات",
    Category = Category.Religious,
    ImageURL = "~/Images/Books/الماجريات.webp",
    NumberOfPages = 180,
    Description = "تقصى الأنباء اليومية المتدفقة وجدل الناس حولها, وتعفب مسلسل الشطحات العقدية والشذوذات الفقهية والتعليقات الفكرية التى تتناسل على شبكات التواصل, والانجرار إلى مطاردة المهاترات الفكرية والقضايا الصغيرة, وتواصل التحديق فى ترقب مماحكاتها ومغايظاتها المتبادلة, والدوران اللاواعى فى مثل هذه الدوامة, وخصوصا بر الهواتف الذكية اللصيقة, يفضى بالمرء إلى الانفصال التدريجى عن روح العمل و تقصى الأنباء اليومية المتدفقة وجدل الناس حولها, وتعفب مسلسل الشطحات العقديةوالشذوذات الفقهية والتعليقات الفكرية التى تتناسل على شبكات التواصل, والانجرار إلى مطاردة المهاترات الفكرية والقضايا الصغيرة, وتواصل التحديق فى ترقب مماحكاتها ومغايظاتها المتبادلة, والدوران اللاواعى فى مثل هذه الدوامة, وخصوصا بر الهواتف الذكية اللصيقة, يفضى بالمرء إلى الانفصال التدريجى عن روح العمل والتنفيذ والانتاج, والشعور بأن المشاهدة والتعليق هى الحالة الطبيعية التى يعيشها طالب العلم والمصلح.\r\nوالمهمة فى معالجة هذا الموضوع مركبة, فنحن بحاجة إلى شخصيات علمية وفكرية ودعوية يكون لها موقف مفصل مدون تجاه إشكالية الإنهماك المفرط فى متابعة الأحداث, بحيث يمكن إعتباره \"نموذجا فكريا\", وفى ذات الوقت نحن مفتقرون إلى معايشة جزء من تجارب هؤلاء لنستثمره فى مداومة أسقام الدافعية التى ولدها الاستغراق فى الماجريات..\r\nوسنحاول فى هذا الكتاب أن نستعرض الحدود الحاكمة لهذه الدراسة, ثم سنتعرض سويا لمنزلة الماجريات فى تصور علماء المسلمين, ثم سننتقل بعد ذلك إلى الماجريات الشبيكية والدراسات الحديثة حولها وعلائق طالب العلم بها. أما الماجريات السياسية فسنحاول فهمها من خلال دراسة نماذج علمية وفكرية جادة ومنتجة كان لها موقف من هذه الإشكالية.",
    Price = 695
}
            };
        }
    }
}